using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Runtime.InteropServices;
using System.Runtime.InteropServices.ComTypes;
using System.IO;
using System.Drawing;
using System.IO.Compression;
using System.Drawing.Imaging;
using System.Windows.Forms;
using System.Reflection;
using Ole;
using System.Collections;

namespace Moxel
{
     public class Moxel
    {
        const int UNITS_PER_INCH = 1440;
        const int UNITS_PER_PIXEL = UNITS_PER_INCH / 96;
        const int LOGPIXELSX = 88;
        const int LOGPIXELSY = 90;
        const int MOXEL_UNITS_PER_INCH = 288;
        const float CoordsCoeff = UNITS_PER_INCH / MOXEL_UNITS_PER_INCH;


        int Version = 6;
        public int nAllColumnCount; //всего колонок в таблице
        public int nAllRowCount;    //всего строк в таблице
        public int nAllObjectsCount;//Всего объектов

        public Cellv6 DefFormat;
        public Dictionary<int, LOGFONT> FontList;
        public Dictionary<int, string> stringTable;
        public DataCell TopColon;
        public DataCell BottomColon;

        public Dictionary<int, DataCell> Columns;
        public Dictionary<int, MoxelRow> Rows;
        public List<EmbeddedObject> Objects;
        public List<CellsUnion> Unions;
        public List<Section> VerticalSections;
        public List<Section> HorisontalSections;
        public int[] HorisontalPageBreaks;
        public int[] VerticalPageBreaks;

            OUT_STROKE_PRECIS = 3,
            OUT_TT_PRECIS = 4,
            OUT_DEVICE_PRECIS = 5,
            OUT_RASTER_PRECIS = 6,
            OUT_TT_ONLY_PRECIS = 7,
            OUT_OUTLINE_PRECIS = 8,
            OUT_SCREEN_OUTLINE_PRECIS = 9,
            OUT_PS_ONLY_PRECIS = 10,
        }

        [Flags]
        public enum FontClipPrecision : byte
        {
            CLIP_DEFAULT_PRECIS = 0,
            CLIP_CHARACTER_PRECIS = 1,
            CLIP_STROKE_PRECIS = 2,
            CLIP_MASK = 0xf,
            CLIP_LH_ANGLES = (1 << 4),
            CLIP_TT_ALWAYS = (2 << 4),
            CLIP_DFA_DISABLE = (4 << 4),
            CLIP_EMBEDDED = (8 << 4),
        }
        public enum FontQuality : byte
        {
            DEFAULT_QUALITY = 0,
            DRAFT_QUALITY = 1,
            PROOF_QUALITY = 2,
            NONANTIALIASED_QUALITY = 3,
            ANTIALIASED_QUALITY = 4,
            CLEARTYPE_QUALITY = 5,
            CLEARTYPE_NATURAL_QUALITY = 6,
        }

        [Flags]
        public enum FontPitchAndFamily : byte
        {
            DEFAULT_PITCH = 0,
            FIXED_PITCH = 1,
            VARIABLE_PITCH = 2,
            FF_DONTCARE = (0 << 4),
            FF_ROMAN = (1 << 4),
            FF_SWISS = (2 << 4),
            FF_MODERN = (3 << 4),
            FF_SCRIPT = (4 << 4),
            FF_DECORATIVE = (5 << 4),
        }

        public enum TextControl : byte
        {
            Auto = 0,
            Cut = 1,
            Fill = 2,
            Wrap = 3,
            Red = 4,
            FillAndRed = 5
        };
        #endregion

        [StructLayout(LayoutKind.Sequential, CharSet = CharSet.Ansi, Pack = 1)]
        public struct LOGFONT
        {
            public int lfHeight;
            public int lfWidth;
            public int lfEscapement;
            public int lfOrientation;
            public FontWeight lfWeight;
            [MarshalAs(UnmanagedType.U1)]
            public bool lfItalic;
            [MarshalAs(UnmanagedType.U1)]
            public bool lfUnderline;
            [MarshalAs(UnmanagedType.U1)]
            public bool lfStrikeOut;
            public FontCharSet lfCharSet;
            public FontPrecision lfOutPrecision;
            public FontClipPrecision lfClipPrecision;
            public FontQuality lfQuality;
            public FontPitchAndFamily lfPitchAndFamily;
            [MarshalAs(UnmanagedType.ByValTStr, SizeConst = 32)]
            public string lfFaceName;

            public override string ToString()
            {
                StringBuilder sb = new StringBuilder();
                sb.AppendFormat("lfCharSet: {0}\n", lfCharSet);
                sb.AppendFormat("lfFaceName: {0}\n", lfFaceName);

                return sb.ToString();
            }
        }

        [StructLayout(LayoutKind.Explicit, CharSet = CharSet.Ansi, Pack = 1)]
        public struct Cellv6
        {
            [FieldOffset(0x00)] public MoxelCellFlags dwFlags; // MoxcelCellFlags
        // union{
            [FieldOffset(0x04)] public short wShow; // 1 - да, 0xFFFF - нет. Используется в колонтитулах
            [FieldOffset(0x04)] public short wColumnPosition; // Используется в колонках
            [FieldOffset(0x04)] public short wHeight; // Используется в строках
        //}
        // union{
            [FieldOffset(0x06)] public short wStartPage; // Колонтитулы
            [FieldOffset(0x06)] public short wWidth; // Колонки
            [FieldOffset(0x06)] public short wRowPosition; // Строки
        //}
            [FieldOffset(0x08)] public short wFontNumber;
            [FieldOffset(0x0A)] public short wFontSize;
            [FieldOffset(0x0C)] public clFontWeight bFontBold;
            [MarshalAs(UnmanagedType.U1)]
            [FieldOffset(0x0D)] public bool bFontItalic;
            [MarshalAs(UnmanagedType.U1)]
            [FieldOffset(0x0E)] public bool bFontUnderline;
            [FieldOffset(0x0F)] public TextHorzAlign bHorAlign;
            [FieldOffset(0x10)] public TextVertAlign bVertAlign;
            [FieldOffset(0x11)] public byte bPatternType;
        // union {
            [FieldOffset(0x12)] public BorderStyle bBorderLeft;
            [FieldOffset(0x12)] public ObjectBorderStyle bPictureBorderStyle;
                                                                             //};
                                                                             // union {
            [FieldOffset(0x13)] public BorderStyle bBorderTop;
            [FieldOffset(0x13)] public ObjectBorderWidth bPictureBorderWidth;
        //};
        // union {
            [FieldOffset(0x14)] public BorderStyle bBorderRight;
            [FieldOffset(0x14)] public ObjectBorderPresence bPictureBorderPresence;
            //};
            // union {
            [MarshalAs(UnmanagedType.U1)]
            [FieldOffset(0x15)] public bool bPrintPicture;
            [FieldOffset(0x15)] public BorderStyle bBorderBottom;
        //};
            [FieldOffset(0x16)] public byte bPatternColor;
            [FieldOffset(0x17)] public byte bBorderColor;
            [FieldOffset(0x18)] public byte bFontColor;
            [FieldOffset(0x19)] public byte bBackground;
            [FieldOffset(0x1A)] public TextControl bControlContent; // MoxcelControlContent
            [FieldOffset(0x1B)] public ContentType bType; // MoxcelContentType
            [MarshalAs(UnmanagedType.U1)]
            [FieldOffset(0x1C)] public bool bAllowEdit;
            [FieldOffset(0x1D)] public byte bXZ1;

            public static Cellv6 Empty = new Cellv6
            {
                dwFlags = 0,
                wShow = 0,
                wColumnPosition = 0,
                wHeight = 0,
                wStartPage = 0,
                wWidth = 0,
                wRowPosition = 0,
                wFontNumber = 0,
                wFontSize = 0,
                bFontBold = 0,
                bFontItalic = false,
                bFontUnderline = false,
                bHorAlign = 0,
                bVertAlign = 0,
                bPatternType = 0,
                bBorderLeft = 0,
                bPictureBorderStyle = 0,
                bBorderTop = 0,
                bPictureBorderWidth = 0,
                bBorderRight = 0,
                bPictureBorderPresence = 0,
                bBorderBottom = 0,
                bPrintPicture = false,
                bPatternColor = 0,
                bBorderColor = 0,
                bFontColor = 0,
